{
  "papers": [
    {
      "paperID": 1,
      "title": "PLCPrint: Fingerprinting Memory Attacks in Programmable Logic Controllers",
      "authors": "Marco M. Cook, Angelos K. Maernerides, Dimitrios Pezaros",
      "venuetype": "journal",
      "venue": "IEEE Transactions on Information Forensics and Security",
      "year": 2023,
      "pdflink": "papers/plcprint_2023",
      "bibtex": "@article{cook2023plcprint,\n  title={Plcprint: Fingerprinting memory attacks in programmable logic controllers},\n  author={Cook, Marco M and Marnerides, Angelos K and Pezaros, Dimitrios},\n  journal={IEEE Transactions on Information Forensics and Security},\n  volume={18},\n  pages={3376--3387},\n  year={2023},\n  publisher={IEEE}\n}",
      "onlinelink": "ieeexplore.ieee.org/abstract/document/10130481/",
      "abstract": "Programmable Logic Controllers (PLCs) constitute the functioning basis of Industrial Control Systems (ICS) and hence are often a focal point for attackers to exploit. Previous attacks have seen PLC memory maliciously altered in order to disrupt the underlying physical process. Different types of memory attack can cause a similar impact on the PLC’s operation and result in indistinguishable physical manifestations. Consequently, delays in triaging attacks through digital forensic practices can induce significant financial loss, physical damage to the infrastructure, and degradation of safety. In this work, we propose PLCPrint, a novel vendor-independent fingerprinting approach that utilises PLC memory artefacts to perform detection and classification of memory attacks. PLCPrint uses PLC memory register mapping, a novel method exploiting the relationship between PLC registers and memory artefacts including the PLC application code. Through this, registers are assigned a Mapping Condition (MC) to indicate how they exist within the PLC memory artefacts. We evaluate the performance of PLCPrint over realistic emulations conducted at a real testbed emulating water filtration and distribution. Through PLCPrint we depict how MC deviations are utilised within supervised learning schemes such as to adequately classify PLC memory attacks with high accuracy performance. In general, we demonstrate that PLCPrint fills the gap in the context of attack technique triaging since this has been a missing element within current ICS forensics schemes."
    },
    {
      "paperID": 2,
      "title": "Artefact Provenance Graphs for Anomaly Inference in Industrial Control Systems",
      "authors": "Marco M. Cook, Dimitrios Pezaros",
      "venuetype": "conference",
      "venue": "IFIP International Conference on ICT Systems Security and Privacy Protection",
      "year": 2025,
      "pdflink": "papers/artefactprovenance_2025",
      "bibtex": "@inproceedings{cook2025artefact,\n  title={Artefact Provenance Graphs for Anomaly Inference in Industrial Control Systems},\n  author={Cook, Marco M and Pezaros, Dimitrios},\n  booktitle={IFIP International Conference on ICT Systems Security and Privacy Protection},\n  pages={136--150},\n  year={2025},\n  organization={Springer}\n}",
      "onlinelink": "https://link.springer.com/chapter/10.1007/978-3-031-92882-6_10",
      "abstract": "The digitalisation of Critical National Infrastructure (CNI) to improve automation has resulted in the underlying Industrial Control Systems (ICS) becoming increasingly interconnected. This sudden connectivity combined with a lack of inherent security controls in ICS components such as Programmable Logic Controllers (PLCs) has enabled sophisticated cyber adversaries to disrupt physical processes. Detecting and analysing attacks is therefore essential for ICS operators to ensure the continuous availability of critical systems. However, existing research has made limited advances into data provenance for anomalies occurring in ICS networks. This is fundamental for enabling rapid triaging of cyber incidents. In this paper, we introduce a novel vendor-independent approach for representing the behaviour of PLC states using graphs for anomaly detection. Through the modelling of dependencies between memory and network data artefacts, we facilitate the data provenance of different types of PLC attack scenarios using graph-based metrics as a generalisable feature set for accurate state and node classification. We evaluate our approach using two physical ICS testbeds with real PLCs to demonstrate generalisability across industrial vendors and environments. The results reveal high, achieving up to 98.9% and 98.7% accuracy for anomalous state and node detection, respectively."
    }
  ]
}
